---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ViewFailures.BadViewDirectionSetting
source: html/319d625c-3fc6-3926-0713-810fa488bd63.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ViewFailures.BadViewDirectionSetting Property

Plan view DBViewType has invalid view direction parameter.

## Syntax (C#)
```csharp
public static FailureDefinitionId BadViewDirectionSetting { get; }
```